Repository: tomgly/MyCarLogs
Catalog: lib/l10n/app_*.arb
Languages: es, ja, pt

# lang
source: Language
es: Idioma
ja: 言語
pt: Idioma

# lang_name
source: English
es: Español
pt: Português

# name
source: Car name
es: Nombre del carro
ja: 名前
pt: Nome do Carro

# totalDist
source: Total distance
es: Distancia total
ja: 総距離
pt: Distância Total

source: Year
es: Añor
ja: 年式
pt: Ano

# setting
source: Settings
es: Ajustes
ja: 設定
pt: Configuração

# uas_setting
source: Units and Symbol
es: Simbolos y unidades

source: User Preferences
es: Preferencias de usuario

source: Other
es: Otros

source: Theme Color
es: Color del tema
ja: テーマカラー
pt: Cor de Tema

# pick_themeColor
source: Pick a theme color
es: Selecciona un color
ja: テーマカラーを選んでください
pt: Selecione uma cor de tema

# capitalize
source: Capitalize the first letter
es: Mayúsculas en la primera letra
ja: 最初の文字を大文字にする
pt: Primeira letra maiúscula

# version
source: App Version
es: Versión de la App
ja: バージョン
pt: Versão do aplicativo

source: Submit
es: Enviar
ja: 決定
pt: Enviar

source: Cancel
es: Cancelar
ja: キャンセル
pt: Cancelar

source: DELETE
es: ELIMINAR
ja: 削除
pt: DELETAR

source: Deleted
es: Eliminar
ja: 削除しました
pt: Deletado

# delete_all
source: Delete All Cars
es: Eliminar todos los carros
ja: すべての車を削除
pt: Deletar Todos Carros

# delete_all_alert
source: Are you sure to delete ALL CARS?
es: ¿Estar seguro de querer eliminar TODOS LOS CARRO?
ja: 本当にすべての車を削除してもよろしいですか？
pt: Tem certeza de deletar TODOS CARROS?

# delete_this
source: Delete this car
es: Eliminar este carro
ja: この車を削除
pt: Deletar esse carro

# delete_this_alert
source: Are you sure to delete this car?
es: ¿Estas seguro de eliminar este carro?
ja: 本当にこの車を削除してもよろしいですか？
pt: Tem certeza de deleter este carro?

# addCar
source: Add Your Car
es: Añada su vehículo
ja: 車を追加
pt: Adicione seu carro

source: Select Year
es: Seleccionna un año
ja: 年を選んでください
pt: Selecione o Ano

# error
source: Error, You need to fill all
es: Error, Debe rellenar todos los campos.
ja: エラー, 全て埋めてください
pt: Erro, é preciso preencher todos os campos

# errorNum
source: Error, Enter number for the Total distance
es: Error, Introduzca el número de la distancia total
ja: エラー, 総距離に数字を入力してください
pt: Erro, insira o número para a distância total

# error_totalDist
source: Error, Enter higher number than Total distance
es: Error, introduzca un número superior a la distancia total
ja: エラー, 総距離より大きい数値を入力してください
pt: Erro, insira um número maior do que a distância total

source: Car Detail
es: Detalles del Vehiculo
ja: 車の情報
pt: Detalhes do Carro

source: Fueling Logs
es: Registros de combustible
ja: ガソリン ログ
pt: Histórico de Abastecimento

source: Fuel Amount
es: Cantidad de combustible
ja: ガソリンの量
pt: Quantidade de combustível

source: Cost
es: Precio
ja: 費用
pt: Custo

source: Date
es: Fecha
ja: 日付
pt: Data

source: Add Fueling
es: Añada combustible
ja: ガソリンを追加する
pt: Adicionar Abastecimento

source: Maintenance Logs
es: Registros de mantenimiento
ja: メンテナンス ログ
pt: Histórico de Manutenção

source: Description
es: Descripción
ja: 詳細
pt: Descrição

source: Add Maintenance
es: Añadir mantenimiento
ja: メンテナンスを追加する
pt: Adicionar Manutenção

source: Repair Logs
es: Registros de reparaciones
ja: 修理 ログ
pt: Histórico de Reparos

source: Repair
es: Reparar
ja: 修理内容
pt: Reparos

source: Add Repair
es: Añadir reparación
ja: 修理を追加する
pt: Adicionar Reparo

# editCar
source: Edit Your Car
es: Editar tu vehiculo
ja: 車を編集
pt: Edite Seu Carro

source: Edit Fueling
es: Editar carga de combustible
ja: ガソリンを編集
pt: Edite Abastecimento

# editMaintenance
source: Edit Maintenace
es: Editar Mantenimiento
ja: メンテナンスを編集
pt: Edit Manutenção

source: Edit Repair
es: Editar reparación
ja: 修理を編集
pt: Edit Reparo

# distUnit
source: Distance Unit
es: Unidad de distancia
pt: Unidade de Distância

source: Miles
es: Millas
ja: マイル
pt: Milhas

source: Kilometer
es: Kilometros
ja: キロメートル
pt: Quilômetros

# capUnit
source: Capacity Unit
es: Unidad de capacidad
pt: Unidade de Armazenamento

source: Gallon
es: Galón
ja: ガロン
pt: Galão

source: Litter
es: Litros
ja: リッター
pt: Litro

source: Currency symbol
es: Símbolo de moneda
ja: 通貨記号
pt: Símbolo da Moeda

source: Color
ja: 色
pt: Cor
